/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_map_validity.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: junmkang <junmkang@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/26 01:42:46 by junmkang          #+#    #+#             */
/*   Updated: 2020/12/26 02:06:25 by junmkang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "map_chk.h"

// 유효성 검사 파트.
int		ft_map_validity(char **chk_map, int i, int j)
{
	int		nx[4] = {0, 1, 0, -1};
	int		ny[4] = {1, 0, -1, 0};
	int		k;

	k = 4;
	while(k)
	{
		k--;
	}
	return (0);
}